app/views/comments/_form.html.erb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
and I think the value for @post is coming from the post/show.html view
that comes from @post = Post.find(params[:id]) in the posts controller-->