app/views/pages/home.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 2]]
---
      <p>
        <% post.comments.each do |comment| %>