app/controllers/admin_controller.rb

  def index
    @all_users = User.all
    @all_posts = Post.all
---
SELECT "users".* FROM "users"
SELECT "posts".* FROM "posts"