app/controllers/comments_controller.rb

  def create
    # This is creating a new comment object with the parameters sent by the form
    @comment = Comment.new(comment_params)
    # This is taking the current user id and assigning it to the comment.user_id because it belongs to the user and the user can have many comments.
    @comment.user_id = current_user.id
    # This is taking the parameters of id for the post and assigning it to the post id in the new comment object, instead of having the hidden field in the post, this is more secure.
    # @comment.post_id = params[:post_id]
    # Grabs the id for the current post and instantiates it. This was sent via the comment form on the comments/_form page
    # @post = params[:post_id]
    @post = Post.friendly.find(params[:post_id])
    @comment.post_id = @post.id
    puts @comment.inspect
    puts @post.id

    # @post = params[:post_id]

    respond_to do |format|
      # this saves the comment object into the database and if successfully saved will redirect to the show page of the post to display the comments under the post
      if @comment.save
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("content", "post_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "Grass is awesome."], ["post_id", 1], ["user_id", 1], ["created_at", 2017-03-28 05:38:32 UTC], ["updated_at", 2017-03-28 05:38:32 UTC]]