app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "content", "user_id", "created_at", "updated_at", "slug") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Test 2"], ["content", "THe grass is blue and I'm good."], ["user_id", 3], ["created_at", 2017-03-31 10:34:55 UTC], ["updated_at", 2017-03-31 10:34:55 UTC], ["slug", "test-2"]]
---
  def create
    @post = Post.new(post_params)
    @post.user_id = current_user.id

    respond_to do |format|
      if @post.save